renfernand/cc2538em/cc2538em-master/openwsn/bsp/boards/cc2538em/osens_itf/osens_itf_mote.c
#include "board.h"
#include "stdio.h"
#include <string.h>
#include "hw_ioc.h"             // Access to IOC register defines
#include "hw_ssi.h"             // Access to SSI register defines
#include "hw_sys_ctrl.h"        // Clocking control
#include "hw_memmap.h"
#include "ioc.h"                // Access to driverlib ioc fns
#include "gpio.h"               // Access to driverlib gpio fns
#include "osens.h"
#include "osens_itf.h"
#include "opentimers.h"
#include "scheduler.h"
#include "board.h"
#include "sys_ctrl.h"
#include "osens_itf_mote.h"
#include "uarthal.h"
#include "leds.h"
#include "uart.h"

#define TRACE_ON 0

// minimum tick time is 1
#define MS2TICK(ms) (ms) > OSENS_SM_TICK_MS ? (ms) / OSENS_SM_TICK_MS : 1

enum {
    OSENS_STATE_INIT = 0,
    OSENS_STATE_SEND_ITF_VER = 1,
    OSENS_STATE_WAIT_ITF_VER_ANS = 2,
    OSENS_STATE_PROC_ITF_VER = 3,
    OSENS_STATE_SEND_BRD_ID = 4,
    OSENS_STATE_WAIT_BRD_ID_ANS = 5,
    OSENS_STATE_PROC_BRD_ID = 6,
    OSENS_STATE_SEND_PT_DESC = 7,
    OSENS_STATE_WAIT_PT_DESC_ANS = 8,
    OSENS_STATE_PROC_PT_DESC = 9,
    OSENS_STATE_BUILD_SCH = 10,
    OSENS_STATE_RUN_SCH = 11,
    OSENS_STATE_SEND_PT_VAL = 12,
    OSENS_STATE_WAIT_PT_VAL_ANS = 13,
    OSENS_STATE_PROC_PT_VAL = 14,
    OSENS_STATE_WR_PT = 15,
    OSENS_STATE_WAIT_WR_PT_ANS = 16,
    OSENS_STATE_PROC_WR_PT_ANS = 17
};

#if TRACE_ON == 1
uint8_t *sm_states_str[] = {
    "INIT",
    "SEND_ITF_VER",
    "WAIT_ITF_VER_ANS",
    "PROC_ITF_VER",
    "SEND_BRD_ID",
    "WAIT_BRD_ID_ANS",
    "PROC_BRD_ID",
    "SEND_PT_DESC",
    "WAIT_PT_DESC_ANS",
    "PROC_PT_DESC",
    "BUILD_SCH",
    "RUN_SCH",
    "SEND_PT_VAL",
    "WAIT_PT_VAL_ANS",
    "PROC_PT_VAL",
    "WR_PT",
    "WAIT_WR_PT_ANS",
    "PROC_WR_PT_ANS"
};
#endif

enum {
	OSENS_STATE_EXEC_OK = 0,
	OSENS_STATE_EXEC_WAIT_OK,
	OSENS_STATE_EXEC_WAIT_STOP,
	OSENS_STATE_EXEC_WAIT_ABORT,
	OSENS_STATE_EXEC_ERROR
};

typedef struct osens_mote_sm_state_s
{
	volatile uint16_t trmout_counter;
	volatile uint16_t trmout;
	volatile uint8_t point_index;
	volatile uint8_t frame_arrived;
	volatile uint8_t state;
	volatile uint8_t retries;
} osens_mote_sm_state_t;

typedef uint8_t (*osens_mote_sm_func_t)(osens_mote_sm_state_t *st);

typedef struct osens_mote_sm_table_s
{
	osens_mote_sm_func_t func;
	uint8_t next_state;
	uint8_t abort_state; // for indicating timeout or end of cyclic operation
	uint8_t error_state;
} osens_mote_sm_table_t;


typedef struct osens_acq_schedule_s
{
	uint8_t num_of_points;
	struct points_e
	{
		uint8_t index;
		uint32_t sampling_time_x250ms;
        uint32_t counter;
	} points[OSENS_MAX_POINTS];

	struct scan_e
	{
		uint8_t num_of_points;
		uint8_t index[OSENS_MAX_POINTS];
	} scan;

	struct write_e
	{
		uint8_t prod;
		uint8_t cons;
		uint8_t index[OSENS_MAX_POINTS];
	} write;
} osens_acq_schedule_t;

#define PC_INC_QUEUE(v,mv) (((v) + 1) >= (mv)) ? 0 : (v) + 1

static uint8_t osens_mote_sm_func_build_sch(osens_mote_sm_state_t *st);
static uint8_t osens_mote_sm_func_pt_desc_ans(osens_mote_sm_state_t *st);
static uint8_t osens_mote_sm_func_req_pt_desc(osens_mote_sm_state_t *st);
static uint8_t osens_mote_sm_func_run_sch(osens_mote_sm_state_t *st);

const osens_mote_sm_table_t osens_mote_sm_table[];
const uint8_t datatype_sizes[] = { 1, 1, 2, 2, 4, 4, 8, 8, 4, 8 }; // check osens_datatypes_e order

uint8_t num_rx_bytes;
uint8_t tx_data_len;
uint32_t flagErrorOccurred;

uint8_t frame[OSENS_MAX_FRAME_SIZE];

osens_cmd_req_t cmd;
osens_cmd_res_t ans;

osens_mote_sm_state_t sm_state;
osens_point_ctrl_t sensor_points;
osens_brd_id_t board_info;
osens_acq_schedule_t schedule;


//=========================== prototypes =======================================
//=========================== public ==========================================
void sensor_timer(void);
static void osens_mote_tick(void);
static void buBufFlush(void);
void bspLedToggle(uint8_t ui8Leds);
#if TRACE_ON == 1
static void osens_mote_show_values(void)
{
    uint8_t n;
    OS_UTIL_LOG(1, ("\n"));
    for (n = 0; n < sensor_points.num_of_points; n++)
    {
        switch (sensor_points.points[n].value.type)
        {
        case OSENS_DT_U8:
            OS_UTIL_LOG(1, ("Point %02d: %d\n", n, sensor_points.points[n].value.value.u8));
            break;
        case OSENS_DT_S8:
            OS_UTIL_LOG(1, ("Point %02d: %d\n", n, sensor_points.points[n].value.value.s8));
            break;
        case OSENS_DT_U16:
            OS_UTIL_LOG(1, ("Point %02d: %d\n", n, sensor_points.points[n].value.value.u16));
            break;
        case OSENS_DT_S16:
            OS_UTIL_LOG(1, ("Point %02d: %d\n", n, sensor_points.points[n].value.value.s16));
            break;
        case OSENS_DT_U32:
            OS_UTIL_LOG(1, ("Point %02d: %d\n", n, sensor_points.points[n].value.value.u32));
            break;
        case OSENS_DT_S32:
            OS_UTIL_LOG(1, ("Point %02d: %d\n", n, sensor_points.points[n].value.value.s32));
            break;
        case OSENS_DT_U64:
            OS_UTIL_LOG(1, ("Point %02d: %d\n", n, sensor_points.points[n].value.value.u64));
            break;
        case OSENS_DT_S64:
            OS_UTIL_LOG(1, ("Point %02d: %d\n", n, sensor_points.points[n].value.value.s64));
            break;
        case OSENS_DT_FLOAT:
            OS_UTIL_LOG(1, ("Point %02d: %f\n", n, sensor_points.points[n].value.value.fp32));
            break;
        case OSENS_DT_DOUBLE:
            OS_UTIL_LOG(1, ("Point %02d: %f\n", n, sensor_points.points[n].value.value.fp64));
            break;
        default:
            break;
       }
    }
}
#endif

uint8_t osens_mote_init(void)
{

	memset(&sm_state, 0, sizeof(osens_mote_sm_state_t));
	sm_state.state = OSENS_STATE_INIT;

	//buBufFlush();
    opentimers_start(OSENS_SM_TICK_MS, TIMER_PERIODIC, TIME_MS, (opentimers_cbt) osens_mote_tick);

    return 0;
}


static uint8_t osens_mote_pack_send_frame(osens_cmd_req_t *cmd, uint8_t cmd_size)
{
    uint8_t size;

    size = osens_pack_cmd_req(cmd, frame);

    if (size != cmd_size)
        return OSENS_STATE_EXEC_ERROR;

    if (osens_mote_send_frame(frame, cmd_size) != cmd_size)
    	return OSENS_STATE_EXEC_ERROR;

