renfernand/cc2538em/cc2538em-master/openwsn/bsp/boards/cc2538em/osens_itf/osens_itf_mote.c
    return OSENS_STATE_EXEC_OK;
}

static uint8_t osens_mote_sm_func_pt_val_ans(osens_mote_sm_state_t *st)
{
	uint8_t point;
	uint8_t size;
    uint8_t ans_size;

    point = schedule.scan.index[st->point_index];
    ans_size = 6 + datatype_sizes[sensor_points.points[point].desc.type];

    size = osens_unpack_cmd_res(&ans, frame, ans_size);

    // retry ?
    if (size != ans_size || ans.hdr.addr != (OSENS_REGMAP_READ_POINT_DATA_1 + point))
        return OSENS_STATE_EXEC_OK;

    // ok, save and go to the next
    memcpy(&sensor_points.points[point].value, &ans.payload.point_value_cmd, sizeof(osens_point_t));

    st->retries = 0;
    st->point_index++;

#if TRACE_ON == 1
    osens_mote_show_values();
#endif

    return OSENS_STATE_EXEC_OK;
}

static uint8_t osens_mote_sm_func_req_pt_val(osens_mote_sm_state_t *st)
{
    uint8_t point;

	// end of point reading
    if(st->point_index >= schedule.scan.num_of_points)
    	return OSENS_STATE_EXEC_WAIT_ABORT;

    // error condition after 3 retries
	st->retries++;
	if(st->retries > 3)
		return OSENS_STATE_EXEC_ERROR;

	point = schedule.scan.index[st->point_index];
    cmd.hdr.addr = OSENS_REGMAP_READ_POINT_DATA_1 + point;
    st->trmout_counter = 0;
    st->trmout = MS2TICK(5000);
    return osens_mote_pack_send_frame(&cmd, 4);

}

static uint8_t osens_mote_sm_func_proc_wr_pt(osens_mote_sm_state_t *st)
{
	uint8_t point;
	uint8_t size;
	uint8_t ans_size = 5;

    point = schedule.write.index[st->point_index];

    size = osens_unpack_cmd_res(&ans, frame, ans_size);

    // retry ?
    if (size != ans_size || ans.hdr.addr != (OSENS_REGMAP_WRITE_POINT_DATA_1 + point))
        return OSENS_STATE_EXEC_OK;

    // ok,  go to the next
    schedule.write.cons = PC_INC_QUEUE(schedule.write.cons, OSENS_MAX_POINTS);
    st->retries = 0;

    return OSENS_STATE_EXEC_OK;
}

static uint8_t osens_mote_sm_func_wr_pt(osens_mote_sm_state_t *st)
{
	uint8_t point;
	uint8_t c = schedule.write.cons;
	uint8_t p = schedule.write.prod;
	uint8_t size;

	// end of point writing
	if(c == p)
		return OSENS_STATE_EXEC_WAIT_ABORT;

    // error condition after 3 retries
	st->retries++;
	if(st->retries > 3)
		return OSENS_STATE_EXEC_ERROR;

#if TRACE_ON == 1
    printf("==> Consuming at position %d\n", c);
#endif

    st->point_index = c;
    point = schedule.write.index[st->point_index];
    cmd.hdr.addr = OSENS_REGMAP_WRITE_POINT_DATA_1 + point;
    st->trmout_counter = 0;
    st->trmout = MS2TICK(5000);

    size = 5 + datatype_sizes[sensor_points.points[point].desc.type];
    memcpy(&cmd.payload.point_value_cmd, &sensor_points.points[point].value, sizeof(osens_point_t));

    return osens_mote_pack_send_frame(&cmd,size);
}

static uint8_t osens_mote_sm_func_run_sch(osens_mote_sm_state_t *st)
{
    uint8_t n;

    leds_error_toggle();

	// priorize writings over data scan/schedule execution
	if(schedule.write.prod != schedule.write.cons)
	{
#if TRACE_ON == 1
        printf("==> New writing item to be consumed (P: %d <> C: d%)\n", schedule.write.prod, schedule.write.cons);
#endif
    	st->retries = 0;
		return OSENS_STATE_EXEC_ERROR;
	}

    schedule.scan.num_of_points = 0;

    for (n = 0; n < schedule.num_of_points; n++)
    {

    	if(schedule.points[n].counter > 0)
    		schedule.points[n].counter--;

        if (schedule.points[n].counter == 0)
        {
            // n: point index in the schedule database
            // index: point index in the points database
            uint8_t index = schedule.points[n].index;

            schedule.scan.index[schedule.scan.num_of_points] = index;
        	schedule.scan.num_of_points++;
            // restore counter value for next cycle
            schedule.points[n].counter = schedule.points[n].sampling_time_x250ms;
        }

    }

    if(schedule.scan.num_of_points > 0)
    {
    	st->point_index = 0;
    	st->retries = 0;

#if TRACE_ON == 1
    {
            OS_UTIL_LOG(1, ("\n"));
            OS_UTIL_LOG(1, ("Next Scan\n"));
            OS_UTIL_LOG(1, ("=========\n"));
            for (n = 0; n < schedule.scan.num_of_points; n++)
            {
                OS_UTIL_LOG(1, ("--> %u [%u]\n", n,schedule.scan.index[n]));
            }
    }
#endif

    	return OSENS_STATE_EXEC_WAIT_ABORT;
    }
    else
    	return OSENS_STATE_EXEC_WAIT_OK;
}

static uint8_t osens_mote_sm_func_build_sch(osens_mote_sm_state_t *st)
{
	uint8_t n, m;

    schedule.num_of_points = 0;

    for (n = 0, m = 0; n < board_info.num_of_points; n++)
    {
        if ((sensor_points.points[n].desc.access_rights & OSENS_ACCESS_READ_ONLY) &&
            (sensor_points.points[n].desc.sampling_time_x250ms > 0))
        {
            schedule.points[m].index = n;
            schedule.points[m].counter = sensor_points.points[n].desc.sampling_time_x250ms;
            schedule.points[m].sampling_time_x250ms = sensor_points.points[n].desc.sampling_time_x250ms;

            m++;
            schedule.num_of_points++;
        }
    }

#if TRACE_ON == 1
    OS_UTIL_LOG(1,("\n"));
    OS_UTIL_LOG(1, ("Schedule\n"));
    OS_UTIL_LOG(1, ("========\n"));
    for (n = 0; n < schedule.num_of_points; n++)
    {
        OS_UTIL_LOG(1, ("[%d] point %02d at %dms\n", n, schedule.points[n].index, schedule.points[n].sampling_time_x250ms * 250));
    }
#endif

    return OSENS_STATE_EXEC_OK;
}

static uint8_t osens_mote_sm_func_pt_desc_ans(osens_mote_sm_state_t *st)
{
	uint8_t size;
    uint8_t ans_size = 20;

    size = osens_unpack_cmd_res(&ans, frame, ans_size);

    if (size != ans_size || (ans.hdr.addr != OSENS_REGMAP_POINT_DESC_1 + st->point_index))
        return OSENS_STATE_EXEC_ERROR;

    // save description and type, value is not available yet
    memcpy(&sensor_points.points[st->point_index].desc,&ans.payload.point_desc_cmd,sizeof(osens_point_desc_t));
    sensor_points.points[st->point_index].value.type = sensor_points.points[st->point_index].desc.type;

#if TRACE_ON == 1
    {
        uint8_t n = st->point_index;
        OS_UTIL_LOG(1, ("\n"));
        OS_UTIL_LOG(1, ("Point %02d info\n", n));
        OS_UTIL_LOG(1, ("=============\n"));
        OS_UTIL_LOG(1, ("Name     : %-8s\n", sensor_points.points[n].desc.name));
        OS_UTIL_LOG(1, ("Type     : %d\n", sensor_points.points[n].desc.type));
        OS_UTIL_LOG(1, ("Unit     : %d\n", sensor_points.points[n].desc.unit));
        OS_UTIL_LOG(1, ("Rights   : %02X\n", sensor_points.points[n].desc.access_rights));
        OS_UTIL_LOG(1, ("Sampling : %d\n\n", sensor_points.points[n].desc.sampling_time_x250ms));
    }
#endif

    st->retries = 0;
    st->point_index++;
    sensor_points.num_of_points = st->point_index;

