renfernand/cc2538em/cc2538em-master/openwsn/bsp/boards/cc2538em/osens_itf/osens_itf_mote.c
    return OSENS_STATE_EXEC_OK;
}

static uint8_t osens_mote_sm_func_req_pt_desc(osens_mote_sm_state_t *st)
{
    if(st->point_index >= board_info.num_of_points)
    	return OSENS_STATE_EXEC_WAIT_ABORT;

    // error condition after 3 retries
    st->retries++;
    if (st->retries > 3)
        return OSENS_STATE_EXEC_ERROR;

    cmd.hdr.addr = OSENS_REGMAP_POINT_DESC_1 + st->point_index;
    st->trmout_counter = 0;
    st->trmout = MS2TICK(5000);
    return osens_mote_pack_send_frame(&cmd, 4);
}

static uint8_t osens_mote_sm_func_proc_brd_id_ans(osens_mote_sm_state_t *st)
{
	uint8_t size;
    uint8_t ans_size = 28;

    st->point_index = 0;

    size = osens_unpack_cmd_res(&ans, frame, ans_size);

    if (size != ans_size)
    	return OSENS_STATE_EXEC_ERROR;

    memcpy(&board_info, &ans.payload.brd_id_cmd, sizeof(osens_brd_id_t));

    if ((board_info.num_of_points == 0) || (board_info.num_of_points > OSENS_MAX_POINTS))
    	return OSENS_STATE_EXEC_ERROR;

#if TRACE_ON == 1
    OS_UTIL_LOG(1, ("\n"));
    OS_UTIL_LOG(1, ("Board info\n"));
    OS_UTIL_LOG(1, ("==========\n"));
    OS_UTIL_LOG(1, ("Manufactor : %-8s\n", board_info.manufactor));
    OS_UTIL_LOG(1, ("Model      : %-8s\n", board_info.model));
    OS_UTIL_LOG(1, ("ID         : %08X\n", board_info.sensor_id));
    OS_UTIL_LOG(1, ("HW REV     : %02X\n", board_info.hardware_revision));
    OS_UTIL_LOG(1, ("Capabilties: %02X\n", board_info.cabalities));
    OS_UTIL_LOG(1, ("Points     : %d\n\n", board_info.num_of_points));
#endif

    sensor_points.num_of_points = 0;
    st->retries = 0;

    return OSENS_STATE_EXEC_OK;
}

static uint8_t osens_mote_sm_func_req_brd_id(osens_mote_sm_state_t *st)
{
	cmd.hdr.size = 4;
	cmd.hdr.addr = OSENS_REGMAP_BRD_ID;
    st->trmout_counter = 0;
    st->trmout = MS2TICK(5000);
    return osens_mote_pack_send_frame(&cmd, 4);
}


static uint8_t osens_mote_sm_func_proc_itf_ver_ans(osens_mote_sm_state_t *st)
{
    uint8_t size;
    uint8_t ans_size = 6;

    size = osens_unpack_cmd_res(&ans, frame, ans_size);

	if (size != ans_size)
    	return OSENS_STATE_EXEC_ERROR;

    if ((OSENS_ANS_OK != ans.hdr.status) || (OSENS_LATEST_VERSION != ans.payload.itf_version_cmd.version))
    	return OSENS_STATE_EXEC_ERROR;


    return OSENS_STATE_EXEC_OK;
}


static uint8_t osens_mote_sm_func_wait_ans(osens_mote_sm_state_t *st)
{

	/* TODO!!!! MELHORAR O Tratamento do final de frame
	 * Devido ao problema da UART nao estar reconhecendo o final do frame
	 * a rotina esperar um ciclo de scan (250ms) entao se recebeu algum dado ele diz
	 * que recebeu o frame. Posteriormente sera tratado o frame e verificado se recebeu tudo
	 */
	if ((st->trmout_counter > 0) && (num_rx_bytes > 3))
	{
        st->frame_arrived = 1;
		num_rx_bytes = 0;
	}

	if(st->frame_arrived)
	{
        st->frame_arrived = 0;
		return OSENS_STATE_EXEC_WAIT_STOP;
	}

	st->trmout_counter++;

	if(st->trmout_counter > st->trmout)
	{
		//se ocorreu timeout e existe bytes no buffer rx considero que recebeu msg
		if (num_rx_bytes > 0)
		{
			return OSENS_STATE_EXEC_WAIT_STOP;
		}
		else
		{
			return OSENS_STATE_EXEC_WAIT_ABORT;
		}
	}

	return OSENS_STATE_EXEC_WAIT_OK;
}


static uint8_t osens_mote_sm_func_req_ver(osens_mote_sm_state_t *st)
{
    cmd.hdr.addr = OSENS_REGMAP_ITF_VERSION;
    st->trmout_counter = 0;
    st->trmout = MS2TICK(5000);
    return osens_mote_pack_send_frame(&cmd, 4);
}


static uint8_t osens_mote_sm_func_init(osens_mote_sm_state_t *st)
{
	uint8_t ret = OSENS_STATE_EXEC_OK;

	leds_error_on();

	memset(&cmd, 0, sizeof(cmd));
	memset(&ans, 0, sizeof(ans));
    memset(&sensor_points, 0, sizeof(sensor_points));
	memset(&board_info, 0, sizeof(board_info));
	memset(&schedule, 0, sizeof(schedule));
	memset(st, 0, sizeof(osens_mote_sm_state_t));

	num_rx_bytes=0;

	return ret;
}

void osens_mote_sm(void)
{
	uint8_t ret;

#if TRACE_ON == 1
	uint8_t ls = sm_state.state;
	#endif

	ret = osens_mote_sm_table[sm_state.state].func(&sm_state);

	if (flagErrorOccurred)
	{
      //reset uart
	  uart1_clearTxInterrupts();
	  uart1_clearRxInterrupts();      // clear possible pending interrupts
	  uart1_enableInterrupts();       // Enable USCI_A1 TX & RX interrupt

	  flagErrorOccurred = 0;
	}

	switch(ret)
	{
		case OSENS_STATE_EXEC_OK:
		case OSENS_STATE_EXEC_WAIT_STOP:
			sm_state.state = osens_mote_sm_table[sm_state.state].next_state;
			break;
		case OSENS_STATE_EXEC_WAIT_OK:
			// still waiting
			break;
		case OSENS_STATE_EXEC_WAIT_ABORT:
			// wait timeout
			sm_state.state = osens_mote_sm_table[sm_state.state].abort_state;
			break;
		case OSENS_STATE_EXEC_ERROR:
		default:
			sm_state.state = osens_mote_sm_table[sm_state.state].error_state;
			break;
	}

#if TRACE_ON == 1
    printf("[SM]  %llu    (%02d) %-16s -> (%02d) %-16s\n", tick_counter, ls, sm_states_str[ls], sm_state.state,sm_states_str[sm_state.state]);

    {
        uint8_t index = 1;
        osens_point_t point;
        if (sensor_points.points[0].value.value.u8 >= 90 && sensor_points.points[1].value.value.u8 == 0)
        {
            point.value.u8 = 1;
            osens_set_pvalue(index, &point);
}

        if (sensor_points.points[0].value.value.u8 < 90 && sensor_points.points[1].value.value.u8 == 1)
{
            point.value.u8 = 0;
            osens_set_pvalue(index, &point);
        }
}
#endif

}

static void osens_mote_tick(void)
{
    scheduler_push_task((task_cbt) osens_mote_sm, TASKPRIO_OSENS_MAIN);
}

const osens_mote_sm_table_t osens_mote_sm_table[] =
{     //{ func,                                next_state,                   abort_state,              error_state       }
		{ osens_mote_sm_func_init,             OSENS_STATE_SEND_ITF_VER,     OSENS_STATE_INIT,         OSENS_STATE_INIT  }, // OSENS_STATE_INIT
		{ osens_mote_sm_func_req_ver,          OSENS_STATE_WAIT_ITF_VER_ANS, OSENS_STATE_INIT,         OSENS_STATE_INIT  }, // OSENS_STATE_SEND_ITF_VER
		{ osens_mote_sm_func_wait_ans,         OSENS_STATE_PROC_ITF_VER,     OSENS_STATE_INIT,         OSENS_STATE_INIT  }, // OSENS_STATE_WAIT_ITF_VER_ANS
		{ osens_mote_sm_func_proc_itf_ver_ans, OSENS_STATE_SEND_BRD_ID,      OSENS_STATE_INIT,         OSENS_STATE_INIT  }, // OSENS_STATE_PROC_ITF_VER
		{ osens_mote_sm_func_req_brd_id,       OSENS_STATE_WAIT_BRD_ID_ANS,  OSENS_STATE_INIT,         OSENS_STATE_INIT  }, // OSENS_STATE_SEND_BRD_ID
		{ osens_mote_sm_func_wait_ans,         OSENS_STATE_PROC_BRD_ID,      OSENS_STATE_INIT,         OSENS_STATE_INIT  }, // OSENS_STATE_WAIT_BRD_ID_ANS
		{ osens_mote_sm_func_proc_brd_id_ans,  OSENS_STATE_SEND_PT_DESC,     OSENS_STATE_INIT,         OSENS_STATE_INIT  }, // OSENS_STATE_PROC_BRD_ID
		{ osens_mote_sm_func_req_pt_desc,      OSENS_STATE_WAIT_PT_DESC_ANS, OSENS_STATE_BUILD_SCH,    OSENS_STATE_INIT  }, // OSENS_STATE_SEND_PT_DESC
        { osens_mote_sm_func_wait_ans,         OSENS_STATE_PROC_PT_DESC,     OSENS_STATE_SEND_PT_DESC, OSENS_STATE_INIT  }, // OSENS_STATE_WAIT_PT_DESC_ANS
		{ osens_mote_sm_func_pt_desc_ans,      OSENS_STATE_SEND_PT_DESC,     OSENS_STATE_INIT,         OSENS_STATE_INIT  }, // OSENS_STATE_PROC_PT_DESC
		{ osens_mote_sm_func_build_sch,        OSENS_STATE_RUN_SCH,          OSENS_STATE_INIT,         OSENS_STATE_INIT  }, // OSENS_STATE_BUILD_SCH
		{ osens_mote_sm_func_run_sch,          OSENS_STATE_RUN_SCH,          OSENS_STATE_SEND_PT_VAL,  OSENS_STATE_WR_PT }, // OSENS_STATE_RUN_SCH
		{ osens_mote_sm_func_req_pt_val,       OSENS_STATE_WAIT_PT_VAL_ANS,  OSENS_STATE_RUN_SCH,      OSENS_STATE_INIT  }, // OSENS_STATE_SEND_PT_VAL
		{ osens_mote_sm_func_wait_ans,         OSENS_STATE_PROC_PT_VAL,      OSENS_STATE_SEND_PT_VAL,  OSENS_STATE_INIT  }, // OSENS_STATE_WAIT_PT_VAL_ANS
		{ osens_mote_sm_func_pt_val_ans,       OSENS_STATE_SEND_PT_VAL,      OSENS_STATE_INIT,         OSENS_STATE_INIT  }, // OSENS_STATE_PROC_PT_VAL
		{ osens_mote_sm_func_wr_pt,            OSENS_STATE_WAIT_WR_PT_ANS,   OSENS_STATE_RUN_SCH,      OSENS_STATE_INIT  }, // OSENS_STATE_WR_PT
		{ osens_mote_sm_func_wait_ans,         OSENS_STATE_PROC_WR_PT_ANS,   OSENS_STATE_WR_PT,        OSENS_STATE_INIT  }, // OSENS_STATE_WAIT_WR_PT_ANS
		{ osens_mote_sm_func_proc_wr_pt,       OSENS_STATE_WR_PT,            OSENS_STATE_INIT,         OSENS_STATE_INIT } // OSENS_STATE_PROC_WR_PT_ANS
};

uint8_t osens_init(void)
{
	osens_mote_init();
	return 0;
}

uint8_t osens_get_num_points(void)
{
	if(sm_state.state >= OSENS_STATE_SEND_PT_DESC)
	{
		return board_info.num_of_points;
	}
	else
		return 0;
}

uint8_t osens_get_brd_desc(osens_brd_id_t *brd)
{
	if(sm_state.state >= OSENS_STATE_SEND_PT_DESC)
	{
		memcpy(brd,&board_info,sizeof(osens_brd_id_t));
		return 1;
	}
	else
		return 0;
}

uint8_t osens_get_pdesc(uint8_t index, osens_point_desc_t *desc)
{
	if((sm_state.state >= OSENS_STATE_RUN_SCH) && (index < sensor_points.num_of_points))
	{
		memcpy(desc,&sensor_points.points[index].desc,sizeof(osens_point_desc_t));
		return 1;
	}
	else
		return 0;
}

int8_t osens_get_ptype(uint8_t index)
{
	if((sm_state.state >= OSENS_STATE_RUN_SCH) && (index < sensor_points.num_of_points))
	{
		return sensor_points.points[index].value.type;
	}
	else
		return -1;
}

