renfernand/cc2538em/cc2538em-master/openwsn/bsp/boards/cc2538em/osens_itf/osens_itf_mote.c
uint8_t osens_get_point(uint8_t index, osens_point_t *point)
{
	if((sm_state.state >= OSENS_STATE_RUN_SCH) && (index < sensor_points.num_of_points))
	{
		memcpy(point,&sensor_points.points[index].value,sizeof(osens_point_t));
		return 1;
	}
	else
		return 0;
}

uint8_t osens_set_pvalue(uint8_t index, osens_point_t *point)
{
	if((sm_state.state >= OSENS_STATE_RUN_SCH) && (index < sensor_points.num_of_points))
	{
		if(sensor_points.points[index].desc.access_rights & OSENS_ACCESS_WRITE_ONLY)
		{
			uint8_t pn;
			uint8_t p = schedule.write.prod;
			uint8_t c = schedule.write.cons;

			pn = PC_INC_QUEUE(p,OSENS_MAX_POINTS);

			// no space in prod/cons queue (check next)
			if (pn == c)
            {
#if TRACE_ON == 1
                printf("==> No space in writing queue (P: %d->%d, C: %d)\n",p,pn,c);
#endif
				return 0;
            }

#if TRACE_ON == 1
            printf("==> Producing at position %d\n", p);
#endif
			// schedule point for writing and update value
			schedule.write.index[p] = index;
			sensor_points.points[index].value.value = point->value;
			schedule.write.prod = pn;

			// run the mote state machine
			osens_mote_tick();

			return 1;
		}
		else
			return 0;
	}
	else
		return 0;
}

/**************************************************************************//**
* @brief    This function puts up to \e size bytes into the BSP UART TX
*           buffer and starts to transfer data over UART.
*
*           If \b BSP_UART_ALL_OR_NOTHING is defined, data is put into the
*           TX buffer only if there is room for all \e size bytes.
*
* @param    frame            is a pointer to the source buffer.
* @param    size            is the number of bytes to transfer.
*
* @return   Returns the number of bytes actually copied to the TX buffer.
******************************************************************************/

uint8_t osens_mote_send_frame(uint8_t *frame, uint8_t size)
{
 	uint16_t ui16Length=size;
    register uint16_t ui16Idx = 0;

    DISABLE_INTERRUPTS();
    while((ui16Idx < ui16Length))
    {
        UARTCharPut(BSP_UART_BASE, frame[ui16Idx++]);
    }
    ENABLE_INTERRUPTS();

    return ((uint8_t) ui16Length);
}

/**************************************************************************//**
* @brief    This function pushes a byte from the UART RX FIFO to the BSP UART
*           RX buffer. The function handles RX buffer wrap-around, but does not
*           handle RX buffer overflow. The function should only be called if
*           there is data in the UART RX FIFO. It modifies volatile variables
*           and should only be called when interrupts are disabled.
*
* @brief    None
******************************************************************************/
static void buBufPushByte(void)
{
    uint32_t value;

    // Push byte from RX FIFO to buffer
    value = UARTCharGetNonBlocking(OSENS_UART_BASE);

    if (num_rx_bytes < OSENS_MAX_FRAME_SIZE)
    	frame[num_rx_bytes] = (uint8_t) value;

    num_rx_bytes++;
    if (num_rx_bytes >= OSENS_MAX_FRAME_SIZE)
        num_rx_bytes = 0;
}


/**************************************************************************//**
* @brief    This function flushes the ringbuffer control structure specified
*           by \e psBuf.
*
* @param    psBuf       is a pointer to a \e tBuBuf ringbuffer structure.
*
* @return   None
******************************************************************************/
static void buBufFlush(void)
{
    // Start of critical section
    bool bIntDisabled = IntMasterDisable();

    num_rx_bytes = 0;

    if(!bIntDisabled)
    {
        IntMasterEnable();
    }
}


void uart1_isr_private(void)
{
    uint32_t ui32IntBm = UARTIntStatus(OSENS_UART_BASE, 1);
    //uint8_t dummy=0;

    UARTIntClear(OSENS_UART_BASE, (ui32IntBm & 0xF0));

    //ERROR LINE
    if (ui32IntBm & (UART_INT_BE | UART_INT_PE | UART_INT_FE))
	{
    	UARTRxErrorClear(OSENS_UART_BASE);
    	buBufFlush();
    	flagErrorOccurred = 1;
        //while(UARTCharsAvail(OSENS_UART_BASE))
        //{
        //	dummy = UARTCharGetNonBlocking(OSENS_UART_BASE);
        //}
	}
    else if(ui32IntBm & (UART_INT_OE))
	{    //OVERRUN
    	UARTRxErrorClear(OSENS_UART_BASE);
        buBufFlush();
    	flagErrorOccurred = 1;
    	//dummy = UARTCharGetNonBlocking(OSENS_UART_BASE);
        //while(UARTCharsAvail(OSENS_UART_BASE))
        //{
        //	dummy = UARTCharGetNonBlocking(OSENS_UART_BASE);
        //}
	}
    else if(ui32IntBm & (UART_INT_RX | UART_INT_RT))
    {
        //
        // Put received bytes into buffer
        //
        //while(UARTCharsAvail(BSP_UART_BASE) && !BU_IS_BUF_FULL(&sBuBufRx))
        while(UARTCharsAvail(OSENS_UART_BASE))
        {
            buBufPushByte();
        }


        //if (ui32IntBm & UART_INT_RT)
        //{
        //	sm_state.frame_arrived = true;
        //}

    }
    else if(ui32IntBm & UART_INT_TX)
    {
        //while(UARTSpaceAvail(BSP_UART_BASE) && (!BU_IS_BUF_EMPTY(&sBuBufTx)))
        //{
        //    buBufPopByte();
        //}
    }
}

